notes/conference-talk-ideas/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Conference Talk Ideas</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Conference Talk Ideas</h1>
</header><p>
In the future I would like to give presentations at software conferences. Here
are few topic ideas:
</p>

<div id="outline-container-orgc910fe1" class="outline-2">
<h2 id="orgc910fe1">Neat Tricks When Building .NET Pipelines</h2>
<div class="outline-text-2" id="text-orgc910fe1">
<p>
Command line tools such as git and dotnet are terrific assets for building and
publishing your applications. We will investigate how they can be used in
different situations:
</p>

<ul class="org-ul">
<li>Using git commands such as <code>git rev-parse</code>, <code>git clean</code> and <code>git describe</code> to
improve a build pipeline</li>
<li>The versatility of <code>dotnet publish</code>
<ul class="org-ul">
<li>Single binary, ahead-of-time compilation and self-contained builds</li>
<li>Add commit ID information</li>
</ul></li>
<li>Utility dotnet sub-commands such as <code>dotnet format</code> or <code>dotnet list package
  --outdated</code></li>
<li>Derive version information from a <code>CHANGELOG.md</code> file, automate release
commits and tagging</li>
</ul>
</div>
</div>

<div id="outline-container-org766ac53" class="outline-2">
<h2 id="org766ac53">Home Cooked Software: A Backup Story</h2>
<div class="outline-text-2" id="text-org766ac53">
<p>
In the last few years I built <a href="https://github.com/fwinkelbauer/chunkyard/">Chunkyard</a>, a backup tool which combines full and
incremental backups while also including features such as copying and validating
backups. Chunkyard does not offer anything new that other open source backup
tools miss, but it gave me several opportunities to explore topics such as:
</p>

<ul class="org-ul">
<li>How backup applications with deduplication work</li>
<li>Cross platform development in .NET</li>
<li>Testing new language features</li>
<li>Limit myself to the standard library (e.g. writing my own CLI parser)</li>
<li>Create a useful and fast testing suite</li>
<li>Tinker with build and publish automation</li>
<li>Do tiny performance experiments</li>
</ul>
</div>
</div>

<div id="outline-container-org310fc7b" class="outline-2">
<h2 id="org310fc7b">Content Addressable Storage + Content Defined Chunking</h2>
<div class="outline-text-2" id="text-org310fc7b">
<p>
Modern backup tools use techniques such as content addressable storage and
content defined chunking to create deduplicated and verifiable backups. We will
explore how these techniques work and how they could be applied to other areas
such as:
</p>

<ul class="org-ul">
<li>Version control systems</li>
<li>Application downloader/updater</li>
<li>Artifact storage for build pipelines</li>
<li>Verifiable URLs</li>
</ul>
</div>
</div>

<div id="outline-container-orgfc2538c" class="outline-2">
<h2 id="orgfc2538c">Teaching an Old <del>Dog</del> Monolith New Tricks</h2>
<div class="outline-text-2" id="text-orgfc2538c">
<p>
Some of us are still doing manual deployments to ship software. Let's have a
look at a concrete example of a distributed monolith and what we can do to
automate its deployment:
</p>

<ul class="org-ul">
<li>Implement a "deployment configuration" using a templating language, reusable
configuration files and scripts</li>
<li>Generate a "deployment configuration" using different criteria</li>
<li>Use a package manager like <a href="https://chocolatey.org/">Chocolatey</a> (Windows)</li>
</ul>
</div>
</div>

<div id="outline-container-orgf0cbd98" class="outline-2">
<h2 id="orgf0cbd98">Git as a Tool for Thinking</h2>
<div class="outline-text-2" id="text-orgf0cbd98">
<p>
Gamers know that it's a good idea to click "save" whenever they are about to do
something significant, risky or stupid. In the same sense developers should
"save" (commit) all the freaking time too:
</p>

<ul class="org-ul">
<li>Feel the power of resets and interactive rebases</li>
<li>Use stashes, branches and WIP commits for experiments</li>
<li>Apply partial staging to reflect and review your work</li>
<li>Use worktrees for some sweet documentation</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
<p>Copyright 2024, Florian Winkelbauer. All rights reserved.</p>
</footer>
</div>
</body>
</html>
